
        <div class="importPageContainer">

            <div class="info">
                <h1>Добави дисциплини</h1>
                <p>
                    Дисциплините се добавят като JSON текст във формата, който е показан в текстовото поле. </br>
                    Можете да валидирате JSON текста си в  <a href="https://jsonlint.com/">JSONLint</a> , преди да го качите.
                </p>
            </div>
            <div class="importContainer">
            <form id="uploadFile" method="POST" action="<?php echo URLROOT; ?>/disciplines/uploadFile" enctype="multipart/form-data">
                <div id="formBody">
                    <label>Качи JSON файл ...</label>
                    <input type="file" name="jsonFile" id="jsonFile" accept=".json" required onchange="updateFileName(this)">
                    <label id="fileName" for="jsonFile" class="custom-file-upload">Избери файл</label>
                    <input type="submit" value="Качи">
                </div>
            </form>

            <script>
                function updateFileName(input) {
                    var fileNameSpan = document.getElementById('fileName');
                    fileNameSpan.textContent = input.files[0].name;
                }
            </script>
            <form id="importJson" method="POST" action="<?php echo URLROOT; ?>/disciplines/import">
                <div id="formBody">

                    <label>... или напиши своя JSON тук</label>
                    <textarea name="mainInfo" class="<?php echo (!empty($data['mainInfo_err'])) ? 'is_invalid' : '';?>" value="<?php echo $data['mainInfo'];?>">

            [{
                "Дисциплина": "Име на дисциплина 1",
                "Discipline": "Име на дисциплина 1 (английски)",
                "Специалности": [{
                    "Специалност1": ["Курс(цифра)", "Курс(цифра)"],
                    "Специалност2": ["Курс(цифра)", "Курс(цифра)"]
                }],
                "Категория": "ОКН",
                "ОКС": ["Бакалавър", "Магистър"],
                "Академични години": ["2018\/2019", "2020\/2021"],
                "Преподавател": "име",
                "Статут": "задължителна/избираема",
                "Семестър": "Летен",
                "Кредити": "5",
                "Анотация":  "Анотация",
                "Предварителни изисквания": "Текст.",
                "Очаквани резултати": "Текст.",
                "Съдържание": ["Тема1", "Тема2", "..."],
                            "Конспект": ["Тема1", "Тема2", "..."],
                            "Библиография": ["Източник 1", "Източник 2"],
                "Код": "код",
                "Зависи от": ["спицеалност1", "спицеалност2","..."],
                "Зависят от нея": ["спицеалност1", "спицеалност2","..."],
                "Административна информация": {
                    "Утвърдена с решение на ФС с протокол": "№",
                                "Утвърдил": "Декан на ФМИ",
                                "Произволно поле":"Стойност"
                }
            },{
                "Дисциплина": "Име на дисциплина 2",
                "Discipline": "Име на дисциплина 2 (английски)",
                "Специалности": [{
                    "Специалност1": ["Курс(цифра)", "Курс(цифра)"],
                    "Специалност2": ["Курс(цифра)", "Курс(цифра)"]
                }],
                "Категория": "ОКН",
                "ОКС": ["Бакалавър", "Магистър"],
                "Академични години": ["2018\/2019", "2020\/2021"],
                "Преподавател": "име",
                "Статут": "задължителна/избираема",
                "Семестър": "Летен",
                "Кредити": "5",
                "Анотация":  "Анотация",
                "Предварителни изисквания": "Текст.",
                "Очаквани резултати": "Текст.",
                "Съдържание": ["Тема1", "Тема2", "..."],
                            "Конспект": ["Тема1", "Тема2", "..."],
                            "Библиография": ["Източник 1", "Източник 2"],
                "Код": "код",
                "Зависи от": ["спицеалност1", "спицеалност2","..."],
                "Зависят от нея": ["спицеалност1", "спицеалност2","..."],
                "Административна информация": {
                    "Утвърдена с решение на ФС с протокол": "№",
                                "Утвърдил": "Декан на ФМИ",
                                "Произволно поле":"Стойност"
                }
            }]

                    </textarea>
                    <span class="invalid-feedback"><?php echo $data['mainInfo_err'];?></span>
                    <input type="submit" value="Импорт">
                </div>
            </form>
        </div>
    </div>



