{
    "Дисциплина": "Приложно-програмни интерфейси за работа с облачни архитектури с Амазон Уеб Услуги (AWS)",
    "Discipline": "Application programming interfaces for Cloud Architectures with AWS",
    "Специалности": [
        {
            "Софтуерно инженерство": [
                "3",
                "4"
            ],
            "Компютърни науки": [
                "3",
                "4"
            ]
        }
    ],
    "Категория": "ОКН",
    "ОКС": [
        "Бакалавър"
    ],
    "Академични години": [
        "2018\/2019",
        "2020\/2021"
    ],
    "Преподавател": "доц. д-р Милен Йорданов Петров",
    "Статут": "избираема",
    "Семестър": "Летен",
    "Кредити": "5",
    "Анотация": "Дисциплината адресира необходимото ниво знанияна за създаване на архитектурни решения с уеб услуги на Амазон (AWS).Предвидено е постепенно представяне на информацията и постепенно надграждане на знанията.Дисциплината въвежда някои от най-често използваните услуги на Амазон Уеб Услугииприложно-програмните интерфейси свързани с тях–теория и практически примери.Разглеждат се и различни аспекти от сигурността при разработване и използване на AWS.",
    "Предварителни изисквания": "Операционни системи: Линукс, основни познания за вътрешни Shell командиМрежи:основниималкопо-задълбоченипознания–адресиране(IP),маски,шлюзове,протоколи (HTTP\/HTTPS), Telnet\/SSH;Работно владеене на някакъв текстообработващ редактор, работещ под Линукс\n",
    "Очаквани резултати": "След завършване на курса студентите ще могат да:\\n1. Създават програми на обектно-ориентиран език java\\nв режим на конзолен интерфейс (console language interface – CLI), и\\nчрез интегрирана среда за разработка на приложения,\\n2. подготовка на документация на проект (чрез javadoc),\\n4. входно-изходни операции и форматиране на изхода,\\n3. да разработва обектно-ориентирани програми като създава и разпознава конструкциите и принципите от обектно-ориентираното програмиране:\\nкласове,\\nобекти,\\nсвойства, изпращане на съобщения\\nметоди за достъп и\n енкапсулация\\n наследяване\\n полиморфизъм\\n интерфейси\\nабстрактни класове\\n интерфейси\\nсъздаване на графичен потребителски интерфейс и\\nпрограмиране, базирано на събития.\\nПознаване на структурата и характеристиките на Java технологиите.\\nмогат да създават изключения - потребителски и вътрешни и обработката на изключения и грешки.\\nДа познават последните промени в Java технологиите и съответно езикът за програмиране Java.\\nКурсът включва и теми за напреднали като:\\nобработка на символни низове и регулярни изрази,\\nрефлекция,\\nсериализация на данни и интернационализация на приложения.\\nЩе се разгледат множество практически примери на обектно ориентирани програми,\\nкато внимание ще се обърне върху създаването на добър стил за програмиране и форматиране на създадените програми.\\nЩе се разгледат разликите с други езици за програмиране – както такива, базирани на виртуална машина – като например .Net езиците като C Sharp, така и с процедурни езици като C и обектно-ориентирани езици, които не са базирани на виртуална машина като C++.\\nЩе се обърне и внимание на преработка на съществуващи програми (refactoring) и върху основи на софтуерното инженерство в ООП – като софтуерен дизайн и обратно-инженерство (reverse engineering).\\nВ курса ще се ползват последна версия на Java (към момента това е JDK 7) и последна версия на интегрирана среда за разработка (например към момента NetBeans 7.2.1+ или Eclipse 4+).",
    "Съдържание": [
        "Основни концепции: - Мрежи (DNS, IP адреси, маскиране); - Сигурност; - Операционни системи (Линукс);",
        "Основи на Амазон AWS: - Региони; AZs; Крайни Локации; Акаунти; ARNs; Тагове;  - Конзола, CLI, APIs Амазон Виртуално Частно Облачно Пространство (VPC); Амазон Еластично Компютърно Пространство(EC2)и Амазон Еластично Блоково Пространство (EBS):-Типове виртуални машини; достъп; Имиджи(AMIs); бекъпи; - част1",
        "Амазон Виртуално Частно Облачно Пространство (VPC);\\nАмазон Еластично Компютърно Пространство (EC2) и Амазон\\nЕластично Блоково Пространство (EBS):- Типове виртуални машини; достъп; Имиджи (AMIs); бекъпи; - част1",
        "Системен Мениджър:\\n- Документи;\\n- Място за съхранение на параметри;",
        "Амазон Услуга за Лесно Съхранение (Амазон S3) и Амазон Услуга\\nза Продължително Съхранение (Glacier) - част 1",
        "Амазон Услуга за Лесно Съхранение (Амазон S3) и Амазон Услуга за Продължително Съхранение (Glacier) - част 2",
        "Амазон Ламбда",
        "Сигурност в Амазон Уеб Услуги (AWS):\\n- Амазон Услуга Охрана (GuardDuty);\\n- Амазон Инспектор (Inspector);",
        "Амазон Услуга за Еластично Балансиране",
        "Амазон Услуга за Наблюдение на Облачното Пространство (CloudWatch)",
        "Автоматично Скалиране (Auto Scaling)",
        "AWS Услуга за Управление на Идентифицирането и на Достъпа(Identity and Access Management)",
        "Бази Данни; Амазон Услуга “Обикновена Опашка“ (Amazon Simple Queue Service) и Амазон Услуга за „Обикновено Известяване“ (Amazon Simplenotification Service)",
        "Амазон Услуги: DNS и Route 53; Амазон Услуги за Съхранение на Ключове;"
    ],
    "Конспект": [
        "Област 1: Дизайн на Еластични Архитектури\\n1.1. Избор на механизми за надеждно\/еластично съхранение.\\n1.2. Дизайн на решения с многослойни архитектури.\\n1.3. Дизайн на високо надеждни и\/или устойчиви на грешки архитектури.\\n ",
        "Област 3: Определяне на Сигурни Приложения и Архитектури\\n3.1 Определяне на стратегии при защита на приложните слоеве.\\n3.2 Определяне на стратегии при защита на данните.\\n3.3 Определяне на мрежова инфраструктура за приложения в дадено Виртуално Частно\\nОблачно Пространство (VPC). ",
        "Област 4: Дизайн на Оптимизирани по Отношение на Разходите Архитектури\\n4.1 Дизайн на място за съхранение на данни, оптимизирано по отношение на разходите.\\n4.2 Дизайн на изчислителни ресурси, оптимизирани по отношение на разходите.",
        "Област 5: Определяне на Архитектури, Готови за Експлоатация\\n5.1 Избор на характеристики при дизайн на решения и свързаните с тях приложнопрограмни интерфейси, които дават възможност за оперативни постижения."
    ],
    "Библиография": [
        "[1.] AWS Certified Solutions Architect - Official Study Guide, Joe Baron, Hisham Baz, TimBixler, Biff Gaut, Kevin E. Kelly, Sean Senior, John Stamper; 2017, John Wiley & Sons",
        "[2.] Architecting for the Cloud - AWS Best Practices (October 2018) https:\/\/d1.awsstatic.com\/whitepapers\/AWS_Cloud_Best_Practices.pdf ",
        "[3.] AWS Security Best Practices (August 2016) https:\/\/d1.awsstatic.com\/whitepapers\/Security\/AWS_Security_Best_Practices.pdf",
        "[4.] Security Pillar - AWS Well-Architected Framework (July 2018) https:\/\/d1.awsstatic.com\/whitepapers\/architecture\/AWS-Security-Pillar.pdf ",
        "[5.]Serverless Architectures with AWS Lambda - Overview and Best Practices(November2017)https:\/\/d1.awsstatic.com\/whitepapers\/serverless-architectures-with-aws-lambda.pdf",
        "[6.] AWS Documentation - Guides and API References https:\/\/docs.aws.amazon.com\/index.html#lang\/en_us"
    ],
    "Код": "AWS123",
    "Зависи от": [
        "ОСПР123"
    ],
    "Зависят от нея": [
        ""
    ],
    "Административна информация": {
        "Утвърдена с решение на ФС с протокол": "№ 13 от 17.12.2019",
        "Утвърдил": "Декан на ФМИ"
    }
}