{
	"Дисциплина": "Обектно-ориентирано програмиране",
	"Discipline": "Object-oriented Programming",
	  "Специалности": [{
		"Софтуерно инженерство": ["1", "2", "3"],
		"Компютърни науки": ["1", "2", "3"],
		"Информационни системи": ["1", "2", "3"],
		"Информатика": ["1", "2", "3"],
		"Mатематика и информатика": ["1", "2", "3"]
	}],
	"Категория": "ОКН",
	"ОКС": ["Бакалавър"],
	"Академични години": ["2018\/2019", "2020\/2021"],
	"Преподавател": "доц. Милен Петров",
	"Статут": "избираема",
	"Семестър": "Летен",
	"Кредити": "5",
	"Анотация": "Курсът цели да опресни и обогати познанията на студентите с последните достижения в ООП или ако не са програмирали никога с обектно-ориентиран език - да ги въведе в един съвременен и понастоящем най-широко разпространен обектно-ориентиран език за разработка на софтуер в ИКТ. Курсът ще спомогне и на студентите с едни от основните предизвикателства към студентите и специалистите в областта на информационните и комуникационни технологии - да поддържат високо ниво на знанията и уменията си, като от една страна, това са познанието и прилагането на съвременните достижения в езиците за програмиране, а от друга – прилагането на съвременните технологии, инструменти, методи и средства за разработка на приложения.",
	"Предварителни изисквания": "Операционни системи: Линукс, основни познания за вътрешни Shell командиМрежи:основниималкопо-задълбоченипознания–адресиране(IP),маски,шлюзове,протоколи (HTTP\/HTTPS), Telnet\/SSH;Работно владеене на някакъв текстообработващ редактор, работещ под Линукс\n",
	"Очаквани резултати": "След завършване на курса студентите ще могат да:\\n1. Създават програми на обектно-ориентиран език java\\nв режим на конзолен интерфейс (console language interface – CLI), и\\nчрез интегрирана среда за разработка на приложения,\\n2. подготовка на документация на проект (чрез javadoc),\\n4. входно-изходни операции и форматиране на изхода,\\n3. да разработва обектно-ориентирани програми като създава и разпознава конструкциите и принципите от обектно-ориентираното програмиране:\\nкласове,\\nобекти,\\nсвойства, изпращане на съобщения\\nметоди за достъп и\n енкапсулация\\n наследяване\\n полиморфизъм\\n интерфейси\\nабстрактни класове\\n интерфейси\\nсъздаване на графичен потребителски интерфейс и\\nпрограмиране, базирано на събития.\\nПознаване на структурата и характеристиките на Java технологиите.\\nмогат да създават изключения - потребителски и вътрешни и обработката на изключения и грешки.\\nДа познават последните промени в Java технологиите и съответно езикът за програмиране Java.\\nКурсът включва и теми за напреднали като:\\nобработка на символни низове и регулярни изрази,\\nрефлекция,\\nсериализация на данни и интернационализация на приложения.\\nЩе се разгледат множество практически примери на обектно ориентирани програми,\\nкато внимание ще се обърне върху създаването на добър стил за програмиране и форматиране на създадените програми.\\nЩе се разгледат разликите с други езици за програмиране – както такива, базирани на виртуална машина – като например .Net езиците като C Sharp, така и с процедурни езици като C и обектно-ориентирани езици, които не са базирани на виртуална машина като C++.\\nЩе се обърне и внимание на преработка на съществуващи програми (refactoring) и върху основи на софтуерното инженерство в ООП – като софтуерен дизайн и обратно-инженерство (reverse engineering).\\nВ курса ще се ползват последна версия на Java (към момента това е JDK 7) и последна версия на интегрирана среда за разработка (например към момента NetBeans 7.2.1+ или Eclipse 4+).",
	"Съдържание": ["Въведение в курса", "Java технологии - виртуална машина, език и библиотеки. Реализация и видове проекти", "Въведение в ООП. История на ООП езиците за програмиране. Съвременни обектно-ориентирани езици за програмиране, базирани на вирутална машина. Логическа и физическа организация на програмен код. Пакети и компоненти.", "Преговор на основните концепции в програмирането в ИКТ", "Класове и обкети - конструктори (по подразбиране, без параметри, за общо ползване и за копиране). методи за достъп, полета и област на видимост.", "Наследяване - концепции и видове достъп. Примери.", "Абстрактни класове. ", "Интерфейси. Програмиране с контракти.", "Статични характеристики на класовете - статични методи, полета и класове.", "Грешки и изключения - концепции. Вградени и потребителски дефинирани изключения.", "Събитийно-ориентирано програмиране. Изпращане и получаване на съобщения. Работа с графични потребителски интерфейси. Видове графични интерфейси.", "Моделиране на класове в Java - концепции и означения. Анализ на съществуващи класове.", "Вход\/изход и работа с файлове - текстови и двоични. Форматиране на данните.", "Съвременно състояние на ООП и Java технологиите (разширения на езика)", "Сериализируемост и сериализация на данни.", "Регулярни изрази", "Анотации и рефлекция", "Обектни изброими типове (enum). Динамично зареждане на обекти."],
	"Конспект": ["Класове и обекти 1 – основни принципи. Видове конструктори", "Класове и обекти 2 – методи за достъп. Скриване на състояние и поведение (енкапсулация)", "Класове и обекти 3 – видове методи в класовете. Връзка между класовете. Метод toString.", "Логическа и физическа организация на програмен код.", "Стил за писане на качествени програми.", "Наследяване. Примери.", "Абстрактни класове – особенности и начин на употреба.", "Интерфейси – дефиниране и имплементация.", "Статични характеристики методи и класове – понятия и приложения.", "Изключения и грешки – обработка. Дефиниране и употреба на потребителски изключения. Изключения по време на изпълнение (RuntimeException) и изключения за прихващане (Exception).", "Моделиране на класове – означения и приложение.", "Събития – дефиниране и обработка. Основи на графичен потребителски интерфейс. Класове с видима рамка (JFrame) и класове контейнери (JPanel).", "Преобразуване и форматиране на данни (. Автоматично и потребителско преобразуване.", "Съвременно състояние на езика Java (изключения с ресурси, подобрено прихващане на изключения, switch със символен аргумент, двоични литерали, оператор <> (diamond)).", "Механизъм на сериализация. Примери.", "Работа с регулярни изрази. Практически приложения.", "Анотации – дефиниране и обработка. Механизъм на работа."],
	"Библиография": ["[1] М. Петров, Обектно-ориентирано програмиране (Java), Университетско издателство на Софийски университет „Св. Климент Охридски“, 2013", "[2] Oracle Corp., Learning the Java Language\nOracle Corp., The Java Tutorials, http:\/\/docs.oracle.com\/javase\/tutorial\/, последно посетена на 2013-01-05"],
	"Код": "ООП123",
	"Зависи от": ["ОСПР123"],
	"Зависят от нея": ["AWS123"],
	"Административна информация": {
		"Утвърдена с решение на ФС с протокол": "№ 13 от 17.12.2018",
		"Утвърдил": "Декан на ФМИ"
	}
}